{
	"class_column": {
		"error_msg": "Se debe seleccionar el nombre de la columna que define las clases o etiquetas de los datos.",
        "description": "La columna que define las clases tiene la información de a que correponde cada muestra de los datos.",
        "TODO": "Define how to represent the list of columns of the dataset"
	},
	"features": {
        "TODO": "Define how to represent the list of columns of the dataset"
	},
	"splits_config": {
		"train": [
            {
                "error_msg": "El tamaño del conjunto de entrenamiento debe estar entre 0 y 1.",
                "description": "El conjunto de entrenamiento contiene los datos que se utilizarán para el entrenamiento de un modelo. Su tamaño se debe definir entre el 0 y el 100% de los datos.",
                "type": "float",
                "default": 0.7,
                "minimum": 0,
                "maximum": 1
            }
        ],
		"test": [
            {
                "error_msg": "El tamaño del conjunto de prueba debe estar entre 0 y 1.",
                "description": "El conjunto de prueba contiene los datos que se utilizarán para evaluar un modelo. Su tamaño se debe definir entre el 0 y el 100% de los datos.",
                "type": "float",
                "default": 0.3,
                "minimum": 0,
                "maximum": 1
            }
        ],
		"validation": [
            {
                "error_msg": "El tamaño del conjunto de validación debe estar entre 0 y 1.",
                "description": "El conjunto de validación contiene los datos que se utilizarán para validar un modelo. Su tamaño se debe definir entre el 0 y el 100% de los datos.",
                "type": "float",
                "default": 0,
                "minimum": 0,
                "maximum": 1
            }
        ],
		"shuffle": [
            {
                "error_msg": "El parámetro 'shuffle' debe ser de tipo boolean, debe ser 'true' si se quiere mezclar o revolver los datos al separar los conjuntos.",
                "description": "El parámetro 'shuffle' determina si se revolverán o mezclarán los datos al definir los conjuntos o no. Debe ser de tipo boolean.",
                "type": "boolean",
                "default": true
            }
        ],
		"seed": [
			{
                "error_msg": "El parámetro 'seed' debe ser un entero mayor o igual a 0.",
                "description": "El parámetro 'seed' define un valor con el cuál se obtendrá siempre la misma mezcla de los datos. Debe ser un entero mayor o igual a 0.",
                "type": "integer",
                "default": null,
                "minimum": 0
            }
		],
		"stratify_by_column": [
			{
				"error_msg": "El parámetro 'stratify_by_column' debe ser el nombre de la columna clase de los datos. Debe ser un string.",
                "description": "El parámetro 'stratify_by_column' define si los datos se separarán proporcionalmente según la distribución de clases en cada conjunto.",
                "type": "string",
                "default": null
			}
		]
	},

}
